GopalSaraf/Practicals/PSDL/include/proc/pic18lf448.inc
// Register: RXB1SIDH
#define RXB1SIDH RXB1SIDH
RXB1SIDH                                 equ 0F51h
// bitfield definitions
RXB1SIDH_SID3_POSN                       equ 0000h
RXB1SIDH_SID3_POSITION                   equ 0000h
RXB1SIDH_SID3_SIZE                       equ 0001h
RXB1SIDH_SID3_LENGTH                     equ 0001h
RXB1SIDH_SID3_MASK                       equ 0001h
RXB1SIDH_SID4_POSN                       equ 0001h
RXB1SIDH_SID4_POSITION                   equ 0001h
RXB1SIDH_SID4_SIZE                       equ 0001h
RXB1SIDH_SID4_LENGTH                     equ 0001h
RXB1SIDH_SID4_MASK                       equ 0002h
RXB1SIDH_SID5_POSN                       equ 0002h
RXB1SIDH_SID5_POSITION                   equ 0002h
RXB1SIDH_SID5_SIZE                       equ 0001h
RXB1SIDH_SID5_LENGTH                     equ 0001h
RXB1SIDH_SID5_MASK                       equ 0004h
RXB1SIDH_SID6_POSN                       equ 0003h
RXB1SIDH_SID6_POSITION                   equ 0003h
RXB1SIDH_SID6_SIZE                       equ 0001h
RXB1SIDH_SID6_LENGTH                     equ 0001h
RXB1SIDH_SID6_MASK                       equ 0008h
RXB1SIDH_SID7_POSN                       equ 0004h
RXB1SIDH_SID7_POSITION                   equ 0004h
RXB1SIDH_SID7_SIZE                       equ 0001h
RXB1SIDH_SID7_LENGTH                     equ 0001h
RXB1SIDH_SID7_MASK                       equ 0010h
RXB1SIDH_SID8_POSN                       equ 0005h
RXB1SIDH_SID8_POSITION                   equ 0005h
RXB1SIDH_SID8_SIZE                       equ 0001h
RXB1SIDH_SID8_LENGTH                     equ 0001h
RXB1SIDH_SID8_MASK                       equ 0020h
RXB1SIDH_SID9_POSN                       equ 0006h
RXB1SIDH_SID9_POSITION                   equ 0006h
RXB1SIDH_SID9_SIZE                       equ 0001h
RXB1SIDH_SID9_LENGTH                     equ 0001h
RXB1SIDH_SID9_MASK                       equ 0040h
RXB1SIDH_SID10_POSN                      equ 0007h
RXB1SIDH_SID10_POSITION                  equ 0007h
RXB1SIDH_SID10_SIZE                      equ 0001h
RXB1SIDH_SID10_LENGTH                    equ 0001h
RXB1SIDH_SID10_MASK                      equ 0080h
RXB1SIDH_RXB1SID3_POSN                   equ 0000h
RXB1SIDH_RXB1SID3_POSITION               equ 0000h
RXB1SIDH_RXB1SID3_SIZE                   equ 0001h
RXB1SIDH_RXB1SID3_LENGTH                 equ 0001h
RXB1SIDH_RXB1SID3_MASK                   equ 0001h
RXB1SIDH_RXB1SID4_POSN                   equ 0001h
RXB1SIDH_RXB1SID4_POSITION               equ 0001h
RXB1SIDH_RXB1SID4_SIZE                   equ 0001h
RXB1SIDH_RXB1SID4_LENGTH                 equ 0001h
RXB1SIDH_RXB1SID4_MASK                   equ 0002h
RXB1SIDH_RXB1SID5_POSN                   equ 0002h
RXB1SIDH_RXB1SID5_POSITION               equ 0002h
RXB1SIDH_RXB1SID5_SIZE                   equ 0001h
RXB1SIDH_RXB1SID5_LENGTH                 equ 0001h
RXB1SIDH_RXB1SID5_MASK                   equ 0004h
RXB1SIDH_RXB1SID6_POSN                   equ 0003h
RXB1SIDH_RXB1SID6_POSITION               equ 0003h
RXB1SIDH_RXB1SID6_SIZE                   equ 0001h
RXB1SIDH_RXB1SID6_LENGTH                 equ 0001h
RXB1SIDH_RXB1SID6_MASK                   equ 0008h
RXB1SIDH_RXB1SID7_POSN                   equ 0004h
RXB1SIDH_RXB1SID7_POSITION               equ 0004h
RXB1SIDH_RXB1SID7_SIZE                   equ 0001h
RXB1SIDH_RXB1SID7_LENGTH                 equ 0001h
RXB1SIDH_RXB1SID7_MASK                   equ 0010h
RXB1SIDH_RXB1SID8_POSN                   equ 0005h
RXB1SIDH_RXB1SID8_POSITION               equ 0005h
RXB1SIDH_RXB1SID8_SIZE                   equ 0001h
RXB1SIDH_RXB1SID8_LENGTH                 equ 0001h
RXB1SIDH_RXB1SID8_MASK                   equ 0020h
RXB1SIDH_RXB1SID9_POSN                   equ 0006h
RXB1SIDH_RXB1SID9_POSITION               equ 0006h
RXB1SIDH_RXB1SID9_SIZE                   equ 0001h
RXB1SIDH_RXB1SID9_LENGTH                 equ 0001h
RXB1SIDH_RXB1SID9_MASK                   equ 0040h
RXB1SIDH_RXB1SID10_POSN                  equ 0007h
RXB1SIDH_RXB1SID10_POSITION              equ 0007h
RXB1SIDH_RXB1SID10_SIZE                  equ 0001h
RXB1SIDH_RXB1SID10_LENGTH                equ 0001h
RXB1SIDH_RXB1SID10_MASK                  equ 0080h

// Register: RXB1SIDL
#define RXB1SIDL RXB1SIDL
RXB1SIDL                                 equ 0F52h
// bitfield definitions
RXB1SIDL_EID16_POSN                      equ 0000h
RXB1SIDL_EID16_POSITION                  equ 0000h
RXB1SIDL_EID16_SIZE                      equ 0001h
RXB1SIDL_EID16_LENGTH                    equ 0001h
RXB1SIDL_EID16_MASK                      equ 0001h
RXB1SIDL_EID17_POSN                      equ 0001h
RXB1SIDL_EID17_POSITION                  equ 0001h
RXB1SIDL_EID17_SIZE                      equ 0001h
RXB1SIDL_EID17_LENGTH                    equ 0001h
RXB1SIDL_EID17_MASK                      equ 0002h
RXB1SIDL_EXID_POSN                       equ 0003h
RXB1SIDL_EXID_POSITION                   equ 0003h
RXB1SIDL_EXID_SIZE                       equ 0001h
RXB1SIDL_EXID_LENGTH                     equ 0001h
RXB1SIDL_EXID_MASK                       equ 0008h
RXB1SIDL_SRR_POSN                        equ 0004h
RXB1SIDL_SRR_POSITION                    equ 0004h
RXB1SIDL_SRR_SIZE                        equ 0001h
RXB1SIDL_SRR_LENGTH                      equ 0001h
RXB1SIDL_SRR_MASK                        equ 0010h
RXB1SIDL_SID0_POSN                       equ 0005h
RXB1SIDL_SID0_POSITION                   equ 0005h
RXB1SIDL_SID0_SIZE                       equ 0001h
RXB1SIDL_SID0_LENGTH                     equ 0001h
RXB1SIDL_SID0_MASK                       equ 0020h
RXB1SIDL_SID1_POSN                       equ 0006h
RXB1SIDL_SID1_POSITION                   equ 0006h
RXB1SIDL_SID1_SIZE                       equ 0001h
RXB1SIDL_SID1_LENGTH                     equ 0001h
RXB1SIDL_SID1_MASK                       equ 0040h
RXB1SIDL_SID2_POSN                       equ 0007h
RXB1SIDL_SID2_POSITION                   equ 0007h
RXB1SIDL_SID2_SIZE                       equ 0001h
RXB1SIDL_SID2_LENGTH                     equ 0001h
RXB1SIDL_SID2_MASK                       equ 0080h
RXB1SIDL_RXB1EID16_POSN                  equ 0000h
RXB1SIDL_RXB1EID16_POSITION              equ 0000h
RXB1SIDL_RXB1EID16_SIZE                  equ 0001h
RXB1SIDL_RXB1EID16_LENGTH                equ 0001h
RXB1SIDL_RXB1EID16_MASK                  equ 0001h
RXB1SIDL_RXB1EID17_POSN                  equ 0001h
RXB1SIDL_RXB1EID17_POSITION              equ 0001h
RXB1SIDL_RXB1EID17_SIZE                  equ 0001h
RXB1SIDL_RXB1EID17_LENGTH                equ 0001h
RXB1SIDL_RXB1EID17_MASK                  equ 0002h
RXB1SIDL_RXB1EXID_POSN                   equ 0003h
RXB1SIDL_RXB1EXID_POSITION               equ 0003h
RXB1SIDL_RXB1EXID_SIZE                   equ 0001h
RXB1SIDL_RXB1EXID_LENGTH                 equ 0001h
RXB1SIDL_RXB1EXID_MASK                   equ 0008h
RXB1SIDL_RXB1SRR_POSN                    equ 0004h
RXB1SIDL_RXB1SRR_POSITION                equ 0004h
RXB1SIDL_RXB1SRR_SIZE                    equ 0001h
RXB1SIDL_RXB1SRR_LENGTH                  equ 0001h
RXB1SIDL_RXB1SRR_MASK                    equ 0010h
RXB1SIDL_RXB1SID0_POSN                   equ 0005h
RXB1SIDL_RXB1SID0_POSITION               equ 0005h
RXB1SIDL_RXB1SID0_SIZE                   equ 0001h
RXB1SIDL_RXB1SID0_LENGTH                 equ 0001h
RXB1SIDL_RXB1SID0_MASK                   equ 0020h
RXB1SIDL_RXB1SID1_POSN                   equ 0006h
RXB1SIDL_RXB1SID1_POSITION               equ 0006h
RXB1SIDL_RXB1SID1_SIZE                   equ 0001h
RXB1SIDL_RXB1SID1_LENGTH                 equ 0001h
RXB1SIDL_RXB1SID1_MASK                   equ 0040h
RXB1SIDL_RXB1SID2_POSN                   equ 0007h
RXB1SIDL_RXB1SID2_POSITION               equ 0007h
RXB1SIDL_RXB1SID2_SIZE                   equ 0001h
RXB1SIDL_RXB1SID2_LENGTH                 equ 0001h
RXB1SIDL_RXB1SID2_MASK                   equ 0080h

// Register: RXB1EIDH
#define RXB1EIDH RXB1EIDH
RXB1EIDH                                 equ 0F53h
// bitfield definitions
RXB1EIDH_EID8_POSN                       equ 0000h
RXB1EIDH_EID8_POSITION                   equ 0000h
RXB1EIDH_EID8_SIZE                       equ 0001h
RXB1EIDH_EID8_LENGTH                     equ 0001h
RXB1EIDH_EID8_MASK                       equ 0001h
RXB1EIDH_EID9_POSN                       equ 0001h
RXB1EIDH_EID9_POSITION                   equ 0001h
RXB1EIDH_EID9_SIZE                       equ 0001h
RXB1EIDH_EID9_LENGTH                     equ 0001h
RXB1EIDH_EID9_MASK                       equ 0002h
RXB1EIDH_EID10_POSN                      equ 0002h
RXB1EIDH_EID10_POSITION                  equ 0002h
RXB1EIDH_EID10_SIZE                      equ 0001h
RXB1EIDH_EID10_LENGTH                    equ 0001h
RXB1EIDH_EID10_MASK                      equ 0004h
RXB1EIDH_EID11_POSN                      equ 0003h
RXB1EIDH_EID11_POSITION                  equ 0003h
RXB1EIDH_EID11_SIZE                      equ 0001h
RXB1EIDH_EID11_LENGTH                    equ 0001h
RXB1EIDH_EID11_MASK                      equ 0008h
RXB1EIDH_EID12_POSN                      equ 0004h
RXB1EIDH_EID12_POSITION                  equ 0004h
RXB1EIDH_EID12_SIZE                      equ 0001h
RXB1EIDH_EID12_LENGTH                    equ 0001h
RXB1EIDH_EID12_MASK                      equ 0010h
RXB1EIDH_EID13_POSN                      equ 0005h
RXB1EIDH_EID13_POSITION                  equ 0005h
RXB1EIDH_EID13_SIZE                      equ 0001h
RXB1EIDH_EID13_LENGTH                    equ 0001h
RXB1EIDH_EID13_MASK                      equ 0020h
RXB1EIDH_EID14_POSN                      equ 0006h
RXB1EIDH_EID14_POSITION                  equ 0006h
RXB1EIDH_EID14_SIZE                      equ 0001h
RXB1EIDH_EID14_LENGTH                    equ 0001h
RXB1EIDH_EID14_MASK                      equ 0040h
RXB1EIDH_EID15_POSN                      equ 0007h
RXB1EIDH_EID15_POSITION                  equ 0007h
RXB1EIDH_EID15_SIZE                      equ 0001h
RXB1EIDH_EID15_LENGTH                    equ 0001h
RXB1EIDH_EID15_MASK                      equ 0080h
RXB1EIDH_RXB1EID8_POSN                   equ 0000h
RXB1EIDH_RXB1EID8_POSITION               equ 0000h
RXB1EIDH_RXB1EID8_SIZE                   equ 0001h
RXB1EIDH_RXB1EID8_LENGTH                 equ 0001h
RXB1EIDH_RXB1EID8_MASK                   equ 0001h
RXB1EIDH_RXB1EID9_POSN                   equ 0001h
RXB1EIDH_RXB1EID9_POSITION               equ 0001h
RXB1EIDH_RXB1EID9_SIZE                   equ 0001h
RXB1EIDH_RXB1EID9_LENGTH                 equ 0001h
RXB1EIDH_RXB1EID9_MASK                   equ 0002h
RXB1EIDH_RXB1EID10_POSN                  equ 0002h
RXB1EIDH_RXB1EID10_POSITION              equ 0002h
RXB1EIDH_RXB1EID10_SIZE                  equ 0001h
RXB1EIDH_RXB1EID10_LENGTH                equ 0001h
RXB1EIDH_RXB1EID10_MASK                  equ 0004h
RXB1EIDH_RXB1EID11_POSN                  equ 0003h
RXB1EIDH_RXB1EID11_POSITION              equ 0003h
RXB1EIDH_RXB1EID11_SIZE                  equ 0001h
RXB1EIDH_RXB1EID11_LENGTH                equ 0001h
RXB1EIDH_RXB1EID11_MASK                  equ 0008h
RXB1EIDH_RXB1EID12_POSN                  equ 0004h
RXB1EIDH_RXB1EID12_POSITION              equ 0004h
RXB1EIDH_RXB1EID12_SIZE                  equ 0001h
RXB1EIDH_RXB1EID12_LENGTH                equ 0001h
RXB1EIDH_RXB1EID12_MASK                  equ 0010h
RXB1EIDH_RXB1EID13_POSN                  equ 0005h
RXB1EIDH_RXB1EID13_POSITION              equ 0005h
RXB1EIDH_RXB1EID13_SIZE                  equ 0001h
RXB1EIDH_RXB1EID13_LENGTH                equ 0001h
RXB1EIDH_RXB1EID13_MASK                  equ 0020h
RXB1EIDH_RXB1EID14_POSN                  equ 0006h
RXB1EIDH_RXB1EID14_POSITION              equ 0006h
RXB1EIDH_RXB1EID14_SIZE                  equ 0001h
RXB1EIDH_RXB1EID14_LENGTH                equ 0001h
RXB1EIDH_RXB1EID14_MASK                  equ 0040h
RXB1EIDH_RXB1EID15_POSN                  equ 0007h
RXB1EIDH_RXB1EID15_POSITION              equ 0007h
RXB1EIDH_RXB1EID15_SIZE                  equ 0001h
RXB1EIDH_RXB1EID15_LENGTH                equ 0001h
RXB1EIDH_RXB1EID15_MASK                  equ 0080h

