GopalSaraf/Practicals/PSDL/include/proc/pic18lf448.inc
// Register: RXB0D6
#define RXB0D6 RXB0D6
RXB0D6                                   equ 0F6Ch
// bitfield definitions
RXB0D6_RXB0D60_POSN                      equ 0000h
RXB0D6_RXB0D60_POSITION                  equ 0000h
RXB0D6_RXB0D60_SIZE                      equ 0001h
RXB0D6_RXB0D60_LENGTH                    equ 0001h
RXB0D6_RXB0D60_MASK                      equ 0001h
RXB0D6_RXB0D61_POSN                      equ 0001h
RXB0D6_RXB0D61_POSITION                  equ 0001h
RXB0D6_RXB0D61_SIZE                      equ 0001h
RXB0D6_RXB0D61_LENGTH                    equ 0001h
RXB0D6_RXB0D61_MASK                      equ 0002h
RXB0D6_RXB0D62_POSN                      equ 0002h
RXB0D6_RXB0D62_POSITION                  equ 0002h
RXB0D6_RXB0D62_SIZE                      equ 0001h
RXB0D6_RXB0D62_LENGTH                    equ 0001h
RXB0D6_RXB0D62_MASK                      equ 0004h
RXB0D6_RXB0D63_POSN                      equ 0003h
RXB0D6_RXB0D63_POSITION                  equ 0003h
RXB0D6_RXB0D63_SIZE                      equ 0001h
RXB0D6_RXB0D63_LENGTH                    equ 0001h
RXB0D6_RXB0D63_MASK                      equ 0008h
RXB0D6_RXB0D64_POSN                      equ 0004h
RXB0D6_RXB0D64_POSITION                  equ 0004h
RXB0D6_RXB0D64_SIZE                      equ 0001h
RXB0D6_RXB0D64_LENGTH                    equ 0001h
RXB0D6_RXB0D64_MASK                      equ 0010h
RXB0D6_RXB0D65_POSN                      equ 0005h
RXB0D6_RXB0D65_POSITION                  equ 0005h
RXB0D6_RXB0D65_SIZE                      equ 0001h
RXB0D6_RXB0D65_LENGTH                    equ 0001h
RXB0D6_RXB0D65_MASK                      equ 0020h
RXB0D6_RXB0D66_POSN                      equ 0006h
RXB0D6_RXB0D66_POSITION                  equ 0006h
RXB0D6_RXB0D66_SIZE                      equ 0001h
RXB0D6_RXB0D66_LENGTH                    equ 0001h
RXB0D6_RXB0D66_MASK                      equ 0040h
RXB0D6_RXB0D67_POSN                      equ 0007h
RXB0D6_RXB0D67_POSITION                  equ 0007h
RXB0D6_RXB0D67_SIZE                      equ 0001h
RXB0D6_RXB0D67_LENGTH                    equ 0001h
RXB0D6_RXB0D67_MASK                      equ 0080h
RXB0D6_RB0D60_POSN                       equ 0000h
RXB0D6_RB0D60_POSITION                   equ 0000h
RXB0D6_RB0D60_SIZE                       equ 0001h
RXB0D6_RB0D60_LENGTH                     equ 0001h
RXB0D6_RB0D60_MASK                       equ 0001h
RXB0D6_RB0D61_POSN                       equ 0001h
RXB0D6_RB0D61_POSITION                   equ 0001h
RXB0D6_RB0D61_SIZE                       equ 0001h
RXB0D6_RB0D61_LENGTH                     equ 0001h
RXB0D6_RB0D61_MASK                       equ 0002h
RXB0D6_RB0D62_POSN                       equ 0002h
RXB0D6_RB0D62_POSITION                   equ 0002h
RXB0D6_RB0D62_SIZE                       equ 0001h
RXB0D6_RB0D62_LENGTH                     equ 0001h
RXB0D6_RB0D62_MASK                       equ 0004h
RXB0D6_RB0D63_POSN                       equ 0003h
RXB0D6_RB0D63_POSITION                   equ 0003h
RXB0D6_RB0D63_SIZE                       equ 0001h
RXB0D6_RB0D63_LENGTH                     equ 0001h
RXB0D6_RB0D63_MASK                       equ 0008h
RXB0D6_RB0D64_POSN                       equ 0004h
RXB0D6_RB0D64_POSITION                   equ 0004h
RXB0D6_RB0D64_SIZE                       equ 0001h
RXB0D6_RB0D64_LENGTH                     equ 0001h
RXB0D6_RB0D64_MASK                       equ 0010h
RXB0D6_RB0D65_POSN                       equ 0005h
RXB0D6_RB0D65_POSITION                   equ 0005h
RXB0D6_RB0D65_SIZE                       equ 0001h
RXB0D6_RB0D65_LENGTH                     equ 0001h
RXB0D6_RB0D65_MASK                       equ 0020h
RXB0D6_RB0D66_POSN                       equ 0006h
RXB0D6_RB0D66_POSITION                   equ 0006h
RXB0D6_RB0D66_SIZE                       equ 0001h
RXB0D6_RB0D66_LENGTH                     equ 0001h
RXB0D6_RB0D66_MASK                       equ 0040h
RXB0D6_RB0D67_POSN                       equ 0007h
RXB0D6_RB0D67_POSITION                   equ 0007h
RXB0D6_RB0D67_SIZE                       equ 0001h
RXB0D6_RB0D67_LENGTH                     equ 0001h
RXB0D6_RB0D67_MASK                       equ 0080h

// Register: RXB0D7
#define RXB0D7 RXB0D7
RXB0D7                                   equ 0F6Dh
// bitfield definitions
RXB0D7_RXB0D70_POSN                      equ 0000h
RXB0D7_RXB0D70_POSITION                  equ 0000h
RXB0D7_RXB0D70_SIZE                      equ 0001h
RXB0D7_RXB0D70_LENGTH                    equ 0001h
RXB0D7_RXB0D70_MASK                      equ 0001h
RXB0D7_RXB0D71_POSN                      equ 0001h
RXB0D7_RXB0D71_POSITION                  equ 0001h
RXB0D7_RXB0D71_SIZE                      equ 0001h
RXB0D7_RXB0D71_LENGTH                    equ 0001h
RXB0D7_RXB0D71_MASK                      equ 0002h
RXB0D7_RXB0D72_POSN                      equ 0002h
RXB0D7_RXB0D72_POSITION                  equ 0002h
RXB0D7_RXB0D72_SIZE                      equ 0001h
RXB0D7_RXB0D72_LENGTH                    equ 0001h
RXB0D7_RXB0D72_MASK                      equ 0004h
RXB0D7_RXB0D73_POSN                      equ 0003h
RXB0D7_RXB0D73_POSITION                  equ 0003h
RXB0D7_RXB0D73_SIZE                      equ 0001h
RXB0D7_RXB0D73_LENGTH                    equ 0001h
RXB0D7_RXB0D73_MASK                      equ 0008h
RXB0D7_RXB0D74_POSN                      equ 0004h
RXB0D7_RXB0D74_POSITION                  equ 0004h
RXB0D7_RXB0D74_SIZE                      equ 0001h
RXB0D7_RXB0D74_LENGTH                    equ 0001h
RXB0D7_RXB0D74_MASK                      equ 0010h
RXB0D7_RXB0D75_POSN                      equ 0005h
RXB0D7_RXB0D75_POSITION                  equ 0005h
RXB0D7_RXB0D75_SIZE                      equ 0001h
RXB0D7_RXB0D75_LENGTH                    equ 0001h
RXB0D7_RXB0D75_MASK                      equ 0020h
RXB0D7_RXB0D76_POSN                      equ 0006h
RXB0D7_RXB0D76_POSITION                  equ 0006h
RXB0D7_RXB0D76_SIZE                      equ 0001h
RXB0D7_RXB0D76_LENGTH                    equ 0001h
RXB0D7_RXB0D76_MASK                      equ 0040h
RXB0D7_RXB0D77_POSN                      equ 0007h
RXB0D7_RXB0D77_POSITION                  equ 0007h
RXB0D7_RXB0D77_SIZE                      equ 0001h
RXB0D7_RXB0D77_LENGTH                    equ 0001h
RXB0D7_RXB0D77_MASK                      equ 0080h
RXB0D7_RB0D70_POSN                       equ 0000h
RXB0D7_RB0D70_POSITION                   equ 0000h
RXB0D7_RB0D70_SIZE                       equ 0001h
RXB0D7_RB0D70_LENGTH                     equ 0001h
RXB0D7_RB0D70_MASK                       equ 0001h
RXB0D7_RB0D71_POSN                       equ 0001h
RXB0D7_RB0D71_POSITION                   equ 0001h
RXB0D7_RB0D71_SIZE                       equ 0001h
RXB0D7_RB0D71_LENGTH                     equ 0001h
RXB0D7_RB0D71_MASK                       equ 0002h
RXB0D7_RB0D72_POSN                       equ 0002h
RXB0D7_RB0D72_POSITION                   equ 0002h
RXB0D7_RB0D72_SIZE                       equ 0001h
RXB0D7_RB0D72_LENGTH                     equ 0001h
RXB0D7_RB0D72_MASK                       equ 0004h
RXB0D7_RB0D73_POSN                       equ 0003h
RXB0D7_RB0D73_POSITION                   equ 0003h
RXB0D7_RB0D73_SIZE                       equ 0001h
RXB0D7_RB0D73_LENGTH                     equ 0001h
RXB0D7_RB0D73_MASK                       equ 0008h
RXB0D7_RB0D74_POSN                       equ 0004h
RXB0D7_RB0D74_POSITION                   equ 0004h
RXB0D7_RB0D74_SIZE                       equ 0001h
RXB0D7_RB0D74_LENGTH                     equ 0001h
RXB0D7_RB0D74_MASK                       equ 0010h
RXB0D7_RB0D75_POSN                       equ 0005h
RXB0D7_RB0D75_POSITION                   equ 0005h
RXB0D7_RB0D75_SIZE                       equ 0001h
RXB0D7_RB0D75_LENGTH                     equ 0001h
RXB0D7_RB0D75_MASK                       equ 0020h
RXB0D7_RB0D76_POSN                       equ 0006h
RXB0D7_RB0D76_POSITION                   equ 0006h
RXB0D7_RB0D76_SIZE                       equ 0001h
RXB0D7_RB0D76_LENGTH                     equ 0001h
RXB0D7_RB0D76_MASK                       equ 0040h
RXB0D7_RB0D77_POSN                       equ 0007h
RXB0D7_RB0D77_POSITION                   equ 0007h
RXB0D7_RB0D77_SIZE                       equ 0001h
RXB0D7_RB0D77_LENGTH                     equ 0001h
RXB0D7_RB0D77_MASK                       equ 0080h

// Register: CANSTAT
#define CANSTAT CANSTAT
CANSTAT                                  equ 0F6Eh
// bitfield definitions
CANSTAT_ICODE0_POSN                      equ 0001h
CANSTAT_ICODE0_POSITION                  equ 0001h
CANSTAT_ICODE0_SIZE                      equ 0001h
CANSTAT_ICODE0_LENGTH                    equ 0001h
CANSTAT_ICODE0_MASK                      equ 0002h
CANSTAT_ICODE1_POSN                      equ 0002h
CANSTAT_ICODE1_POSITION                  equ 0002h
CANSTAT_ICODE1_SIZE                      equ 0001h
CANSTAT_ICODE1_LENGTH                    equ 0001h
CANSTAT_ICODE1_MASK                      equ 0004h
CANSTAT_ICODE2_POSN                      equ 0003h
CANSTAT_ICODE2_POSITION                  equ 0003h
CANSTAT_ICODE2_SIZE                      equ 0001h
CANSTAT_ICODE2_LENGTH                    equ 0001h
CANSTAT_ICODE2_MASK                      equ 0008h
CANSTAT_OPMODE0_POSN                     equ 0005h
CANSTAT_OPMODE0_POSITION                 equ 0005h
CANSTAT_OPMODE0_SIZE                     equ 0001h
CANSTAT_OPMODE0_LENGTH                   equ 0001h
CANSTAT_OPMODE0_MASK                     equ 0020h
CANSTAT_OPMODE1_POSN                     equ 0006h
CANSTAT_OPMODE1_POSITION                 equ 0006h
CANSTAT_OPMODE1_SIZE                     equ 0001h
CANSTAT_OPMODE1_LENGTH                   equ 0001h
CANSTAT_OPMODE1_MASK                     equ 0040h
CANSTAT_OPMODE2_POSN                     equ 0007h
CANSTAT_OPMODE2_POSITION                 equ 0007h
CANSTAT_OPMODE2_SIZE                     equ 0001h
CANSTAT_OPMODE2_LENGTH                   equ 0001h
CANSTAT_OPMODE2_MASK                     equ 0080h
CANSTAT_EICODE1_POSN                     equ 0001h
CANSTAT_EICODE1_POSITION                 equ 0001h
CANSTAT_EICODE1_SIZE                     equ 0001h
CANSTAT_EICODE1_LENGTH                   equ 0001h
CANSTAT_EICODE1_MASK                     equ 0002h
CANSTAT_EICODE2_POSN                     equ 0002h
CANSTAT_EICODE2_POSITION                 equ 0002h
CANSTAT_EICODE2_SIZE                     equ 0001h
CANSTAT_EICODE2_LENGTH                   equ 0001h
CANSTAT_EICODE2_MASK                     equ 0004h
CANSTAT_EICODE3_POSN                     equ 0003h
CANSTAT_EICODE3_POSITION                 equ 0003h
CANSTAT_EICODE3_SIZE                     equ 0001h
CANSTAT_EICODE3_LENGTH                   equ 0001h
CANSTAT_EICODE3_MASK                     equ 0008h

// Register: CANCON
#define CANCON CANCON
CANCON                                   equ 0F6Fh
// bitfield definitions
CANCON_WIN0_POSN                         equ 0001h
CANCON_WIN0_POSITION                     equ 0001h
CANCON_WIN0_SIZE                         equ 0001h
CANCON_WIN0_LENGTH                       equ 0001h
CANCON_WIN0_MASK                         equ 0002h
CANCON_WIN1_POSN                         equ 0002h
CANCON_WIN1_POSITION                     equ 0002h
CANCON_WIN1_SIZE                         equ 0001h
CANCON_WIN1_LENGTH                       equ 0001h
CANCON_WIN1_MASK                         equ 0004h
CANCON_WIN2_POSN                         equ 0003h
CANCON_WIN2_POSITION                     equ 0003h
CANCON_WIN2_SIZE                         equ 0001h
CANCON_WIN2_LENGTH                       equ 0001h
CANCON_WIN2_MASK                         equ 0008h
CANCON_ABAT_POSN                         equ 0004h
CANCON_ABAT_POSITION                     equ 0004h
CANCON_ABAT_SIZE                         equ 0001h
CANCON_ABAT_LENGTH                       equ 0001h
CANCON_ABAT_MASK                         equ 0010h
CANCON_REQOP0_POSN                       equ 0005h
CANCON_REQOP0_POSITION                   equ 0005h
CANCON_REQOP0_SIZE                       equ 0001h
CANCON_REQOP0_LENGTH                     equ 0001h
CANCON_REQOP0_MASK                       equ 0020h
CANCON_REQOP1_POSN                       equ 0006h
CANCON_REQOP1_POSITION                   equ 0006h
CANCON_REQOP1_SIZE                       equ 0001h
CANCON_REQOP1_LENGTH                     equ 0001h
CANCON_REQOP1_MASK                       equ 0040h
CANCON_REQOP2_POSN                       equ 0007h
CANCON_REQOP2_POSITION                   equ 0007h
CANCON_REQOP2_SIZE                       equ 0001h
CANCON_REQOP2_LENGTH                     equ 0001h
CANCON_REQOP2_MASK                       equ 0080h
CANCON_FP1_POSN                          equ 0001h
CANCON_FP1_POSITION                      equ 0001h
CANCON_FP1_SIZE                          equ 0001h
CANCON_FP1_LENGTH                        equ 0001h
CANCON_FP1_MASK                          equ 0002h
CANCON_FP2_POSN                          equ 0002h
CANCON_FP2_POSITION                      equ 0002h
CANCON_FP2_SIZE                          equ 0001h
CANCON_FP2_LENGTH                        equ 0001h
CANCON_FP2_MASK                          equ 0004h
CANCON_FP3_POSN                          equ 0003h
CANCON_FP3_POSITION                      equ 0003h
CANCON_FP3_SIZE                          equ 0001h
CANCON_FP3_LENGTH                        equ 0001h
CANCON_FP3_MASK                          equ 0008h

