GopalSaraf/Practicals/PSDL/include/proc/pic18lf448.inc
// Register: PIE3
#define PIE3 PIE3
PIE3                                     equ 0FA3h
// bitfield definitions
PIE3_RXB0IE_POSN                         equ 0000h
PIE3_RXB0IE_POSITION                     equ 0000h
PIE3_RXB0IE_SIZE                         equ 0001h
PIE3_RXB0IE_LENGTH                       equ 0001h
PIE3_RXB0IE_MASK                         equ 0001h
PIE3_RXB1IE_POSN                         equ 0001h
PIE3_RXB1IE_POSITION                     equ 0001h
PIE3_RXB1IE_SIZE                         equ 0001h
PIE3_RXB1IE_LENGTH                       equ 0001h
PIE3_RXB1IE_MASK                         equ 0002h
PIE3_TXB0IE_POSN                         equ 0002h
PIE3_TXB0IE_POSITION                     equ 0002h
PIE3_TXB0IE_SIZE                         equ 0001h
PIE3_TXB0IE_LENGTH                       equ 0001h
PIE3_TXB0IE_MASK                         equ 0004h
PIE3_TXB1IE_POSN                         equ 0003h
PIE3_TXB1IE_POSITION                     equ 0003h
PIE3_TXB1IE_SIZE                         equ 0001h
PIE3_TXB1IE_LENGTH                       equ 0001h
PIE3_TXB1IE_MASK                         equ 0008h
PIE3_TXB2IE_POSN                         equ 0004h
PIE3_TXB2IE_POSITION                     equ 0004h
PIE3_TXB2IE_SIZE                         equ 0001h
PIE3_TXB2IE_LENGTH                       equ 0001h
PIE3_TXB2IE_MASK                         equ 0010h
PIE3_ERRIE_POSN                          equ 0005h
PIE3_ERRIE_POSITION                      equ 0005h
PIE3_ERRIE_SIZE                          equ 0001h
PIE3_ERRIE_LENGTH                        equ 0001h
PIE3_ERRIE_MASK                          equ 0020h
PIE3_WAKIE_POSN                          equ 0006h
PIE3_WAKIE_POSITION                      equ 0006h
PIE3_WAKIE_SIZE                          equ 0001h
PIE3_WAKIE_LENGTH                        equ 0001h
PIE3_WAKIE_MASK                          equ 0040h
PIE3_IRXIE_POSN                          equ 0007h
PIE3_IRXIE_POSITION                      equ 0007h
PIE3_IRXIE_SIZE                          equ 0001h
PIE3_IRXIE_LENGTH                        equ 0001h
PIE3_IRXIE_MASK                          equ 0080h
PIE3_RX0IE_POSN                          equ 0000h
PIE3_RX0IE_POSITION                      equ 0000h
PIE3_RX0IE_SIZE                          equ 0001h
PIE3_RX0IE_LENGTH                        equ 0001h
PIE3_RX0IE_MASK                          equ 0001h
PIE3_RX1IE_POSN                          equ 0001h
PIE3_RX1IE_POSITION                      equ 0001h
PIE3_RX1IE_SIZE                          equ 0001h
PIE3_RX1IE_LENGTH                        equ 0001h
PIE3_RX1IE_MASK                          equ 0002h
PIE3_TX0IE_POSN                          equ 0002h
PIE3_TX0IE_POSITION                      equ 0002h
PIE3_TX0IE_SIZE                          equ 0001h
PIE3_TX0IE_LENGTH                        equ 0001h
PIE3_TX0IE_MASK                          equ 0004h
PIE3_TX1IE_POSN                          equ 0003h
PIE3_TX1IE_POSITION                      equ 0003h
PIE3_TX1IE_SIZE                          equ 0001h
PIE3_TX1IE_LENGTH                        equ 0001h
PIE3_TX1IE_MASK                          equ 0008h
PIE3_TX2IE_POSN                          equ 0004h
PIE3_TX2IE_POSITION                      equ 0004h
PIE3_TX2IE_SIZE                          equ 0001h
PIE3_TX2IE_LENGTH                        equ 0001h
PIE3_TX2IE_MASK                          equ 0010h
PIE3_IVRE_POSN                           equ 0007h
PIE3_IVRE_POSITION                       equ 0007h
PIE3_IVRE_SIZE                           equ 0001h
PIE3_IVRE_LENGTH                         equ 0001h
PIE3_IVRE_MASK                           equ 0080h
PIE3_RXBNIE_POSN                         equ 0001h
PIE3_RXBNIE_POSITION                     equ 0001h
PIE3_RXBNIE_SIZE                         equ 0001h
PIE3_RXBNIE_LENGTH                       equ 0001h
PIE3_RXBNIE_MASK                         equ 0002h
PIE3_TXBNIE_POSN                         equ 0004h
PIE3_TXBNIE_POSITION                     equ 0004h
PIE3_TXBNIE_SIZE                         equ 0001h
PIE3_TXBNIE_LENGTH                       equ 0001h
PIE3_TXBNIE_MASK                         equ 0010h

// Register: PIR3
#define PIR3 PIR3
PIR3                                     equ 0FA4h
// bitfield definitions
PIR3_RXB0IF_POSN                         equ 0000h
PIR3_RXB0IF_POSITION                     equ 0000h
PIR3_RXB0IF_SIZE                         equ 0001h
PIR3_RXB0IF_LENGTH                       equ 0001h
PIR3_RXB0IF_MASK                         equ 0001h
PIR3_RXB1IF_POSN                         equ 0001h
PIR3_RXB1IF_POSITION                     equ 0001h
PIR3_RXB1IF_SIZE                         equ 0001h
PIR3_RXB1IF_LENGTH                       equ 0001h
PIR3_RXB1IF_MASK                         equ 0002h
PIR3_TXB0IF_POSN                         equ 0002h
PIR3_TXB0IF_POSITION                     equ 0002h
PIR3_TXB0IF_SIZE                         equ 0001h
PIR3_TXB0IF_LENGTH                       equ 0001h
PIR3_TXB0IF_MASK                         equ 0004h
PIR3_TXB1IF_POSN                         equ 0003h
PIR3_TXB1IF_POSITION                     equ 0003h
PIR3_TXB1IF_SIZE                         equ 0001h
PIR3_TXB1IF_LENGTH                       equ 0001h
PIR3_TXB1IF_MASK                         equ 0008h
PIR3_TXB2IF_POSN                         equ 0004h
PIR3_TXB2IF_POSITION                     equ 0004h
PIR3_TXB2IF_SIZE                         equ 0001h
PIR3_TXB2IF_LENGTH                       equ 0001h
PIR3_TXB2IF_MASK                         equ 0010h
PIR3_ERRIF_POSN                          equ 0005h
PIR3_ERRIF_POSITION                      equ 0005h
PIR3_ERRIF_SIZE                          equ 0001h
PIR3_ERRIF_LENGTH                        equ 0001h
PIR3_ERRIF_MASK                          equ 0020h
PIR3_WAKIF_POSN                          equ 0006h
PIR3_WAKIF_POSITION                      equ 0006h
PIR3_WAKIF_SIZE                          equ 0001h
PIR3_WAKIF_LENGTH                        equ 0001h
PIR3_WAKIF_MASK                          equ 0040h
PIR3_IRXIF_POSN                          equ 0007h
PIR3_IRXIF_POSITION                      equ 0007h
PIR3_IRXIF_SIZE                          equ 0001h
PIR3_IRXIF_LENGTH                        equ 0001h
PIR3_IRXIF_MASK                          equ 0080h
PIR3_RX0IF_POSN                          equ 0000h
PIR3_RX0IF_POSITION                      equ 0000h
PIR3_RX0IF_SIZE                          equ 0001h
PIR3_RX0IF_LENGTH                        equ 0001h
PIR3_RX0IF_MASK                          equ 0001h
PIR3_RX1IF_POSN                          equ 0001h
PIR3_RX1IF_POSITION                      equ 0001h
PIR3_RX1IF_SIZE                          equ 0001h
PIR3_RX1IF_LENGTH                        equ 0001h
PIR3_RX1IF_MASK                          equ 0002h
PIR3_TX0IF_POSN                          equ 0002h
PIR3_TX0IF_POSITION                      equ 0002h
PIR3_TX0IF_SIZE                          equ 0001h
PIR3_TX0IF_LENGTH                        equ 0001h
PIR3_TX0IF_MASK                          equ 0004h
PIR3_TX1IF_POSN                          equ 0003h
PIR3_TX1IF_POSITION                      equ 0003h
PIR3_TX1IF_SIZE                          equ 0001h
PIR3_TX1IF_LENGTH                        equ 0001h
PIR3_TX1IF_MASK                          equ 0008h
PIR3_TX2IF_POSN                          equ 0004h
PIR3_TX2IF_POSITION                      equ 0004h
PIR3_TX2IF_SIZE                          equ 0001h
PIR3_TX2IF_LENGTH                        equ 0001h
PIR3_TX2IF_MASK                          equ 0010h
PIR3_IVRF_POSN                           equ 0007h
PIR3_IVRF_POSITION                       equ 0007h
PIR3_IVRF_SIZE                           equ 0001h
PIR3_IVRF_LENGTH                         equ 0001h
PIR3_IVRF_MASK                           equ 0080h
PIR3_RXBNIF_POSN                         equ 0001h
PIR3_RXBNIF_POSITION                     equ 0001h
PIR3_RXBNIF_SIZE                         equ 0001h
PIR3_RXBNIF_LENGTH                       equ 0001h
PIR3_RXBNIF_MASK                         equ 0002h
PIR3_TXBNIF_POSN                         equ 0004h
PIR3_TXBNIF_POSITION                     equ 0004h
PIR3_TXBNIF_SIZE                         equ 0001h
PIR3_TXBNIF_LENGTH                       equ 0001h
PIR3_TXBNIF_MASK                         equ 0010h

// Register: IPR3
#define IPR3 IPR3
IPR3                                     equ 0FA5h
// bitfield definitions
IPR3_RXB0IP_POSN                         equ 0000h
IPR3_RXB0IP_POSITION                     equ 0000h
IPR3_RXB0IP_SIZE                         equ 0001h
IPR3_RXB0IP_LENGTH                       equ 0001h
IPR3_RXB0IP_MASK                         equ 0001h
IPR3_RXB1IP_POSN                         equ 0001h
IPR3_RXB1IP_POSITION                     equ 0001h
IPR3_RXB1IP_SIZE                         equ 0001h
IPR3_RXB1IP_LENGTH                       equ 0001h
IPR3_RXB1IP_MASK                         equ 0002h
IPR3_TXB0IP_POSN                         equ 0002h
IPR3_TXB0IP_POSITION                     equ 0002h
IPR3_TXB0IP_SIZE                         equ 0001h
IPR3_TXB0IP_LENGTH                       equ 0001h
IPR3_TXB0IP_MASK                         equ 0004h
IPR3_TXB1IP_POSN                         equ 0003h
IPR3_TXB1IP_POSITION                     equ 0003h
IPR3_TXB1IP_SIZE                         equ 0001h
IPR3_TXB1IP_LENGTH                       equ 0001h
IPR3_TXB1IP_MASK                         equ 0008h
IPR3_TXB2IP_POSN                         equ 0004h
IPR3_TXB2IP_POSITION                     equ 0004h
IPR3_TXB2IP_SIZE                         equ 0001h
IPR3_TXB2IP_LENGTH                       equ 0001h
IPR3_TXB2IP_MASK                         equ 0010h
IPR3_ERRIP_POSN                          equ 0005h
IPR3_ERRIP_POSITION                      equ 0005h
IPR3_ERRIP_SIZE                          equ 0001h
IPR3_ERRIP_LENGTH                        equ 0001h
IPR3_ERRIP_MASK                          equ 0020h
IPR3_WAKIP_POSN                          equ 0006h
IPR3_WAKIP_POSITION                      equ 0006h
IPR3_WAKIP_SIZE                          equ 0001h
IPR3_WAKIP_LENGTH                        equ 0001h
IPR3_WAKIP_MASK                          equ 0040h
IPR3_IRXIP_POSN                          equ 0007h
IPR3_IRXIP_POSITION                      equ 0007h
IPR3_IRXIP_SIZE                          equ 0001h
IPR3_IRXIP_LENGTH                        equ 0001h
IPR3_IRXIP_MASK                          equ 0080h
IPR3_IVRP_POSN                           equ 0007h
IPR3_IVRP_POSITION                       equ 0007h
IPR3_IVRP_SIZE                           equ 0001h
IPR3_IVRP_LENGTH                         equ 0001h
IPR3_IVRP_MASK                           equ 0080h
IPR3_RXBNIP_POSN                         equ 0001h
IPR3_RXBNIP_POSITION                     equ 0001h
IPR3_RXBNIP_SIZE                         equ 0001h
IPR3_RXBNIP_LENGTH                       equ 0001h
IPR3_RXBNIP_MASK                         equ 0002h
IPR3_TXBNIP_POSN                         equ 0004h
IPR3_TXBNIP_POSITION                     equ 0004h
IPR3_TXBNIP_SIZE                         equ 0001h
IPR3_TXBNIP_LENGTH                       equ 0001h
IPR3_TXBNIP_MASK                         equ 0010h

// Register: EECON1
#define EECON1 EECON1
EECON1                                   equ 0FA6h
// bitfield definitions
EECON1_RD_POSN                           equ 0000h
EECON1_RD_POSITION                       equ 0000h
EECON1_RD_SIZE                           equ 0001h
EECON1_RD_LENGTH                         equ 0001h
EECON1_RD_MASK                           equ 0001h
EECON1_WR_POSN                           equ 0001h
EECON1_WR_POSITION                       equ 0001h
EECON1_WR_SIZE                           equ 0001h
EECON1_WR_LENGTH                         equ 0001h
EECON1_WR_MASK                           equ 0002h
EECON1_WREN_POSN                         equ 0002h
EECON1_WREN_POSITION                     equ 0002h
EECON1_WREN_SIZE                         equ 0001h
EECON1_WREN_LENGTH                       equ 0001h
EECON1_WREN_MASK                         equ 0004h
EECON1_WRERR_POSN                        equ 0003h
EECON1_WRERR_POSITION                    equ 0003h
EECON1_WRERR_SIZE                        equ 0001h
EECON1_WRERR_LENGTH                      equ 0001h
EECON1_WRERR_MASK                        equ 0008h
EECON1_FREE_POSN                         equ 0004h
EECON1_FREE_POSITION                     equ 0004h
EECON1_FREE_SIZE                         equ 0001h
EECON1_FREE_LENGTH                       equ 0001h
EECON1_FREE_MASK                         equ 0010h
EECON1_CFGS_POSN                         equ 0006h
EECON1_CFGS_POSITION                     equ 0006h
EECON1_CFGS_SIZE                         equ 0001h
EECON1_CFGS_LENGTH                       equ 0001h
EECON1_CFGS_MASK                         equ 0040h
EECON1_EEPGD_POSN                        equ 0007h
EECON1_EEPGD_POSITION                    equ 0007h
EECON1_EEPGD_SIZE                        equ 0001h
EECON1_EEPGD_LENGTH                      equ 0001h
EECON1_EEPGD_MASK                        equ 0080h
EECON1_EEFS_POSN                         equ 0006h
EECON1_EEFS_POSITION                     equ 0006h
EECON1_EEFS_SIZE                         equ 0001h
EECON1_EEFS_LENGTH                       equ 0001h
EECON1_EEFS_MASK                         equ 0040h

// Register: EECON2
#define EECON2 EECON2
EECON2                                   equ 0FA7h

// Register: EEDATA
#define EEDATA EEDATA
EEDATA                                   equ 0FA8h

// Register: EEADR
#define EEADR EEADR
EEADR                                    equ 0FA9h

