GopalSaraf/Practicals/PSDL/include/proc/pic18lf448.inc
#define RXBNIE                           BANKMASK(PIE3), 1, a
#define RXBNIF                           BANKMASK(PIR3), 1, a
#define RXBNIP                           BANKMASK(IPR3), 1, a
#define RXBNOVFL                         BANKMASK(COMSTAT), 6, a
#define RXBP                             BANKMASK(COMSTAT), 3, a
#define RXF0EID0                         BANKMASK(RXF0EIDL), 0, b
#define RXF0EID1                         BANKMASK(RXF0EIDL), 1, b
#define RXF0EID10                        BANKMASK(RXF0EIDH), 2, b
#define RXF0EID11                        BANKMASK(RXF0EIDH), 3, b
#define RXF0EID12                        BANKMASK(RXF0EIDH), 4, b
#define RXF0EID13                        BANKMASK(RXF0EIDH), 5, b
#define RXF0EID14                        BANKMASK(RXF0EIDH), 6, b
#define RXF0EID15                        BANKMASK(RXF0EIDH), 7, b
#define RXF0EID16                        BANKMASK(RXF0SIDL), 0, b
#define RXF0EID17                        BANKMASK(RXF0SIDL), 1, b
#define RXF0EID2                         BANKMASK(RXF0EIDL), 2, b
#define RXF0EID3                         BANKMASK(RXF0EIDL), 3, b
#define RXF0EID4                         BANKMASK(RXF0EIDL), 4, b
#define RXF0EID5                         BANKMASK(RXF0EIDL), 5, b
#define RXF0EID6                         BANKMASK(RXF0EIDL), 6, b
#define RXF0EID7                         BANKMASK(RXF0EIDL), 7, b
#define RXF0EID8                         BANKMASK(RXF0EIDH), 0, b
#define RXF0EID9                         BANKMASK(RXF0EIDH), 1, b
#define RXF0EXIDEN                       BANKMASK(RXF0SIDL), 3, b
#define RXF0SID0                         BANKMASK(RXF0SIDL), 5, b
#define RXF0SID1                         BANKMASK(RXF0SIDL), 6, b
#define RXF0SID10                        BANKMASK(RXF0SIDH), 7, b
#define RXF0SID2                         BANKMASK(RXF0SIDL), 7, b
#define RXF0SID3                         BANKMASK(RXF0SIDH), 0, b
#define RXF0SID4                         BANKMASK(RXF0SIDH), 1, b
#define RXF0SID5                         BANKMASK(RXF0SIDH), 2, b
#define RXF0SID6                         BANKMASK(RXF0SIDH), 3, b
#define RXF0SID7                         BANKMASK(RXF0SIDH), 4, b
#define RXF0SID8                         BANKMASK(RXF0SIDH), 5, b
#define RXF0SID9                         BANKMASK(RXF0SIDH), 6, b
#define RXF1EID0                         BANKMASK(RXF1EIDL), 0, b
#define RXF1EID1                         BANKMASK(RXF1EIDL), 1, b
#define RXF1EID10                        BANKMASK(RXF1EIDH), 2, b
#define RXF1EID11                        BANKMASK(RXF1EIDH), 3, b
#define RXF1EID12                        BANKMASK(RXF1EIDH), 4, b
#define RXF1EID13                        BANKMASK(RXF1EIDH), 5, b
#define RXF1EID14                        BANKMASK(RXF1EIDH), 6, b
#define RXF1EID15                        BANKMASK(RXF1EIDH), 7, b
#define RXF1EID16                        BANKMASK(RXF1SIDL), 0, b
#define RXF1EID17                        BANKMASK(RXF1SIDL), 1, b
#define RXF1EID2                         BANKMASK(RXF1EIDL), 2, b
#define RXF1EID3                         BANKMASK(RXF1EIDL), 3, b
#define RXF1EID4                         BANKMASK(RXF1EIDL), 4, b
#define RXF1EID5                         BANKMASK(RXF1EIDL), 5, b
#define RXF1EID6                         BANKMASK(RXF1EIDL), 6, b
#define RXF1EID7                         BANKMASK(RXF1EIDL), 7, b
#define RXF1EID8                         BANKMASK(RXF1EIDH), 0, b
#define RXF1EID9                         BANKMASK(RXF1EIDH), 1, b
#define RXF1EXIDEN                       BANKMASK(RXF1SIDL), 3, b
#define RXF1SID0                         BANKMASK(RXF1SIDL), 5, b
#define RXF1SID1                         BANKMASK(RXF1SIDL), 6, b
#define RXF1SID10                        BANKMASK(RXF1SIDH), 7, b
#define RXF1SID2                         BANKMASK(RXF1SIDL), 7, b
#define RXF1SID3                         BANKMASK(RXF1SIDH), 0, b
#define RXF1SID4                         BANKMASK(RXF1SIDH), 1, b
#define RXF1SID5                         BANKMASK(RXF1SIDH), 2, b
#define RXF1SID6                         BANKMASK(RXF1SIDH), 3, b
#define RXF1SID7                         BANKMASK(RXF1SIDH), 4, b
#define RXF1SID8                         BANKMASK(RXF1SIDH), 5, b
#define RXF1SID9                         BANKMASK(RXF1SIDH), 6, b
#define RXF2EID0                         BANKMASK(RXF2EIDL), 0, b
#define RXF2EID1                         BANKMASK(RXF2EIDL), 1, b
#define RXF2EID10                        BANKMASK(RXF2EIDH), 2, b
#define RXF2EID11                        BANKMASK(RXF2EIDH), 3, b
#define RXF2EID12                        BANKMASK(RXF2EIDH), 4, b
#define RXF2EID13                        BANKMASK(RXF2EIDH), 5, b
#define RXF2EID14                        BANKMASK(RXF2EIDH), 6, b
#define RXF2EID15                        BANKMASK(RXF2EIDH), 7, b
#define RXF2EID16                        BANKMASK(RXF2SIDL), 0, b
#define RXF2EID17                        BANKMASK(RXF2SIDL), 1, b
#define RXF2EID2                         BANKMASK(RXF2EIDL), 2, b
#define RXF2EID3                         BANKMASK(RXF2EIDL), 3, b
#define RXF2EID4                         BANKMASK(RXF2EIDL), 4, b
#define RXF2EID5                         BANKMASK(RXF2EIDL), 5, b
#define RXF2EID6                         BANKMASK(RXF2EIDL), 6, b
#define RXF2EID7                         BANKMASK(RXF2EIDL), 7, b
#define RXF2EID8                         BANKMASK(RXF2EIDH), 0, b
#define RXF2EID9                         BANKMASK(RXF2EIDH), 1, b
#define RXF2EXIDEN                       BANKMASK(RXF2SIDL), 3, b
#define RXF2SID0                         BANKMASK(RXF2SIDL), 5, b
#define RXF2SID1                         BANKMASK(RXF2SIDL), 6, b
#define RXF2SID10                        BANKMASK(RXF2SIDH), 7, b
#define RXF2SID2                         BANKMASK(RXF2SIDL), 7, b
#define RXF2SID3                         BANKMASK(RXF2SIDH), 0, b
#define RXF2SID4                         BANKMASK(RXF2SIDH), 1, b
#define RXF2SID5                         BANKMASK(RXF2SIDH), 2, b
#define RXF2SID6                         BANKMASK(RXF2SIDH), 3, b
#define RXF2SID7                         BANKMASK(RXF2SIDH), 4, b
#define RXF2SID8                         BANKMASK(RXF2SIDH), 5, b
#define RXF2SID9                         BANKMASK(RXF2SIDH), 6, b
#define RXF3EID0                         BANKMASK(RXF3EIDL), 0, b
#define RXF3EID1                         BANKMASK(RXF3EIDL), 1, b
#define RXF3EID10                        BANKMASK(RXF3EIDH), 2, b
#define RXF3EID11                        BANKMASK(RXF3EIDH), 3, b
#define RXF3EID12                        BANKMASK(RXF3EIDH), 4, b
#define RXF3EID13                        BANKMASK(RXF3EIDH), 5, b
#define RXF3EID14                        BANKMASK(RXF3EIDH), 6, b
#define RXF3EID15                        BANKMASK(RXF3EIDH), 7, b
#define RXF3EID16                        BANKMASK(RXF3SIDL), 0, b
#define RXF3EID17                        BANKMASK(RXF3SIDL), 1, b
#define RXF3EID2                         BANKMASK(RXF3EIDL), 2, b
#define RXF3EID3                         BANKMASK(RXF3EIDL), 3, b
#define RXF3EID4                         BANKMASK(RXF3EIDL), 4, b
#define RXF3EID5                         BANKMASK(RXF3EIDL), 5, b
#define RXF3EID6                         BANKMASK(RXF3EIDL), 6, b
#define RXF3EID7                         BANKMASK(RXF3EIDL), 7, b
#define RXF3EID8                         BANKMASK(RXF3EIDH), 0, b
#define RXF3EID9                         BANKMASK(RXF3EIDH), 1, b
#define RXF3EXIDEN                       BANKMASK(RXF3SIDL), 3, b
#define RXF3SID0                         BANKMASK(RXF3SIDL), 5, b
#define RXF3SID1                         BANKMASK(RXF3SIDL), 6, b
#define RXF3SID10                        BANKMASK(RXF3SIDH), 7, b
#define RXF3SID2                         BANKMASK(RXF3SIDL), 7, b
#define RXF3SID3                         BANKMASK(RXF3SIDH), 0, b
#define RXF3SID4                         BANKMASK(RXF3SIDH), 1, b
#define RXF3SID5                         BANKMASK(RXF3SIDH), 2, b
#define RXF3SID6                         BANKMASK(RXF3SIDH), 3, b
#define RXF3SID7                         BANKMASK(RXF3SIDH), 4, b
#define RXF3SID8                         BANKMASK(RXF3SIDH), 5, b
#define RXF3SID9                         BANKMASK(RXF3SIDH), 6, b
#define RXF4EID0                         BANKMASK(RXF4EIDL), 0, b
#define RXF4EID1                         BANKMASK(RXF4EIDL), 1, b
#define RXF4EID10                        BANKMASK(RXF4EIDH), 2, b
#define RXF4EID11                        BANKMASK(RXF4EIDH), 3, b
#define RXF4EID12                        BANKMASK(RXF4EIDH), 4, b
#define RXF4EID13                        BANKMASK(RXF4EIDH), 5, b
#define RXF4EID14                        BANKMASK(RXF4EIDH), 6, b
#define RXF4EID15                        BANKMASK(RXF4EIDH), 7, b
#define RXF4EID16                        BANKMASK(RXF4SIDL), 0, b
#define RXF4EID17                        BANKMASK(RXF4SIDL), 1, b
#define RXF4EID2                         BANKMASK(RXF4EIDL), 2, b
#define RXF4EID3                         BANKMASK(RXF4EIDL), 3, b
#define RXF4EID4                         BANKMASK(RXF4EIDL), 4, b
#define RXF4EID5                         BANKMASK(RXF4EIDL), 5, b
#define RXF4EID6                         BANKMASK(RXF4EIDL), 6, b
#define RXF4EID7                         BANKMASK(RXF4EIDL), 7, b
#define RXF4EID8                         BANKMASK(RXF4EIDH), 0, b
#define RXF4EID9                         BANKMASK(RXF4EIDH), 1, b
#define RXF4EXIDEN                       BANKMASK(RXF4SIDL), 3, b
#define RXF4SID0                         BANKMASK(RXF4SIDL), 5, b
#define RXF4SID1                         BANKMASK(RXF4SIDL), 6, b
#define RXF4SID10                        BANKMASK(RXF4SIDH), 7, b
#define RXF4SID2                         BANKMASK(RXF4SIDL), 7, b
#define RXF4SID3                         BANKMASK(RXF4SIDH), 0, b
#define RXF4SID4                         BANKMASK(RXF4SIDH), 1, b
#define RXF4SID5                         BANKMASK(RXF4SIDH), 2, b
#define RXF4SID6                         BANKMASK(RXF4SIDH), 3, b
#define RXF4SID7                         BANKMASK(RXF4SIDH), 4, b
#define RXF4SID8                         BANKMASK(RXF4SIDH), 5, b
#define RXF4SID9                         BANKMASK(RXF4SIDH), 6, b
#define RXF5EID0                         BANKMASK(RXF5EIDL), 0, b
#define RXF5EID1                         BANKMASK(RXF5EIDL), 1, b
#define RXF5EID10                        BANKMASK(RXF5EIDH), 2, b
#define RXF5EID11                        BANKMASK(RXF5EIDH), 3, b
#define RXF5EID12                        BANKMASK(RXF5EIDH), 4, b
#define RXF5EID13                        BANKMASK(RXF5EIDH), 5, b
#define RXF5EID14                        BANKMASK(RXF5EIDH), 6, b
#define RXF5EID15                        BANKMASK(RXF5EIDH), 7, b
#define RXF5EID16                        BANKMASK(RXF5SIDL), 0, b
#define RXF5EID17                        BANKMASK(RXF5SIDL), 1, b
#define RXF5EID2                         BANKMASK(RXF5EIDL), 2, b
#define RXF5EID3                         BANKMASK(RXF5EIDL), 3, b
#define RXF5EID4                         BANKMASK(RXF5EIDL), 4, b
#define RXF5EID5                         BANKMASK(RXF5EIDL), 5, b
#define RXF5EID6                         BANKMASK(RXF5EIDL), 6, b
#define RXF5EID7                         BANKMASK(RXF5EIDL), 7, b
#define RXF5EID8                         BANKMASK(RXF5EIDH), 0, b
#define RXF5EID9                         BANKMASK(RXF5EIDH), 1, b
#define RXF5EXIDEN                       BANKMASK(RXF5SIDL), 3, b
#define RXF5SID0                         BANKMASK(RXF5SIDL), 5, b
#define RXF5SID1                         BANKMASK(RXF5SIDL), 6, b
#define RXF5SID10                        BANKMASK(RXF5SIDH), 7, b
#define RXF5SID2                         BANKMASK(RXF5SIDL), 7, b
#define RXF5SID3                         BANKMASK(RXF5SIDH), 0, b
#define RXF5SID4                         BANKMASK(RXF5SIDH), 1, b
#define RXF5SID5                         BANKMASK(RXF5SIDH), 2, b
#define RXF5SID6                         BANKMASK(RXF5SIDH), 3, b
#define RXF5SID7                         BANKMASK(RXF5SIDH), 4, b
#define RXF5SID8                         BANKMASK(RXF5SIDH), 5, b
#define RXF5SID9                         BANKMASK(RXF5SIDH), 6, b
#define RXM0EID0                         BANKMASK(RXM0EIDL), 0, b
#define RXM0EID1                         BANKMASK(RXM0EIDL), 1, b
#define RXM0EID10                        BANKMASK(RXM0EIDH), 2, b
#define RXM0EID11                        BANKMASK(RXM0EIDH), 3, b
#define RXM0EID12                        BANKMASK(RXM0EIDH), 4, b
#define RXM0EID13                        BANKMASK(RXM0EIDH), 5, b
#define RXM0EID14                        BANKMASK(RXM0EIDH), 6, b
#define RXM0EID15                        BANKMASK(RXM0EIDH), 7, b
#define RXM0EID16                        BANKMASK(RXM0SIDL), 0, b
#define RXM0EID17                        BANKMASK(RXM0SIDL), 1, b
#define RXM0EID2                         BANKMASK(RXM0EIDL), 2, b
#define RXM0EID3                         BANKMASK(RXM0EIDL), 3, b
#define RXM0EID4                         BANKMASK(RXM0EIDL), 4, b
#define RXM0EID5                         BANKMASK(RXM0EIDL), 5, b
#define RXM0EID6                         BANKMASK(RXM0EIDL), 6, b
#define RXM0EID7                         BANKMASK(RXM0EIDL), 7, b
#define RXM0EID8                         BANKMASK(RXM0EIDH), 0, b
#define RXM0EID9                         BANKMASK(RXM0EIDH), 1, b
#define RXM0SID0                         BANKMASK(RXM0SIDL), 5, b
#define RXM0SID1                         BANKMASK(RXM0SIDL), 6, b
#define RXM0SID10                        BANKMASK(RXM0SIDH), 7, b
#define RXM0SID2                         BANKMASK(RXM0SIDL), 7, b
#define RXM0SID3                         BANKMASK(RXM0SIDH), 0, b
#define RXM0SID4                         BANKMASK(RXM0SIDH), 1, b
#define RXM0SID5                         BANKMASK(RXM0SIDH), 2, b
#define RXM0SID6                         BANKMASK(RXM0SIDH), 3, b
#define RXM0SID7                         BANKMASK(RXM0SIDH), 4, b
#define RXM0SID8                         BANKMASK(RXM0SIDH), 5, b
#define RXM0SID9                         BANKMASK(RXM0SIDH), 6, b
#define RXM1EID0                         BANKMASK(RXM1EIDL), 0, b
#define RXM1EID1                         BANKMASK(RXM1EIDL), 1, b
#define RXM1EID10                        BANKMASK(RXM1EIDH), 2, b
#define RXM1EID11                        BANKMASK(RXM1EIDH), 3, b
#define RXM1EID12                        BANKMASK(RXM1EIDH), 4, b
#define RXM1EID13                        BANKMASK(RXM1EIDH), 5, b
#define RXM1EID14                        BANKMASK(RXM1EIDH), 6, b
#define RXM1EID15                        BANKMASK(RXM1EIDH), 7, b
#define RXM1EID16                        BANKMASK(RXM1SIDL), 0, b
#define RXM1EID17                        BANKMASK(RXM1SIDL), 1, b
#define RXM1EID2                         BANKMASK(RXM1EIDL), 2, b
#define RXM1EID3                         BANKMASK(RXM1EIDL), 3, b
#define RXM1EID4                         BANKMASK(RXM1EIDL), 4, b
#define RXM1EID5                         BANKMASK(RXM1EIDL), 5, b
#define RXM1EID6                         BANKMASK(RXM1EIDL), 6, b
#define RXM1EID7                         BANKMASK(RXM1EIDL), 7, b
#define RXM1EID8                         BANKMASK(RXM1EIDH), 0, b
#define RXM1EID9                         BANKMASK(RXM1EIDH), 1, b
#define RXM1SID0                         BANKMASK(RXM1SIDL), 5, b
#define RXM1SID1                         BANKMASK(RXM1SIDL), 6, b
#define RXM1SID10                        BANKMASK(RXM1SIDH), 7, b
#define RXM1SID2                         BANKMASK(RXM1SIDL), 7, b
#define RXM1SID3                         BANKMASK(RXM1SIDH), 0, b
#define RXM1SID4                         BANKMASK(RXM1SIDH), 1, b
#define RXM1SID5                         BANKMASK(RXM1SIDH), 2, b
#define RXM1SID6                         BANKMASK(RXM1SIDH), 3, b
#define RXM1SID7                         BANKMASK(RXM1SIDH), 4, b
#define RXM1SID8                         BANKMASK(RXM1SIDH), 5, b
#define RXM1SID9                         BANKMASK(RXM1SIDH), 6, b
#define RXWARN                           BANKMASK(COMSTAT), 1, a
#define R_NOT_W                          BANKMASK(SSPSTAT), 2, a
#define R_W                              BANKMASK(SSPSTAT), 2, a
#define R_nW                             BANKMASK(SSPSTAT), 2, a
#define SAM                              BANKMASK(BRGCON2), 6, a
#define SCK                              BANKMASK(PORTC), 3, a
#define SCL                              BANKMASK(PORTC), 3, a
#define SCS                              BANKMASK(OSCCON), 0, a
#define SDA                              BANKMASK(PORTC), 4, a
#define SDI                              BANKMASK(PORTC), 4, a
#define SDO                              BANKMASK(PORTC), 5, a
#define SEG1PH0                          BANKMASK(BRGCON2), 3, a
#define SEG1PH1                          BANKMASK(BRGCON2), 4, a
#define SEG1PH2                          BANKMASK(BRGCON2), 5, a
#define SEG2PH0                          BANKMASK(BRGCON3), 0, a
#define SEG2PH1                          BANKMASK(BRGCON3), 1, a
#define SEG2PH2                          BANKMASK(BRGCON3), 2, a
#define SEG2PHT                          BANKMASK(BRGCON2), 7, a
#define SEG2PHTS                         BANKMASK(BRGCON2), 7, a
#define SEN                              BANKMASK(SSPCON2), 0, a
#define SJW0                             BANKMASK(BRGCON1), 6, a
#define SJW1                             BANKMASK(BRGCON1), 7, a
#define SMP                              BANKMASK(SSPSTAT), 7, a
#define SOSCEN                           BANKMASK(T1CON), 3, a
#define SOSCEN3                          BANKMASK(T3CON), 3, a
#define SP0                              BANKMASK(STKPTR), 0, a
#define SP1                              BANKMASK(STKPTR), 1, a
#define SP2                              BANKMASK(STKPTR), 2, a
#define SP3                              BANKMASK(STKPTR), 3, a
#define SP4                              BANKMASK(STKPTR), 4, a
#define SPEN                             BANKMASK(RCSTA), 7, a
#define SREN                             BANKMASK(RCSTA), 5, a
#define SRENA                            BANKMASK(RCSTA), 5, a
#define SS                               BANKMASK(PORTA), 5, a
#define SS2                              BANKMASK(PORTD), 7, a
#define SSPEN                            BANKMASK(SSPCON1), 5, a
#define SSPIE                            BANKMASK(PIE1), 3, a
#define SSPIF                            BANKMASK(PIR1), 3, a
#define SSPIP                            BANKMASK(IPR1), 3, a
#define SSPM0                            BANKMASK(SSPCON1), 0, a
#define SSPM1                            BANKMASK(SSPCON1), 1, a
#define SSPM2                            BANKMASK(SSPCON1), 2, a
#define SSPM3                            BANKMASK(SSPCON1), 3, a
#define SSPOV                            BANKMASK(SSPCON1), 6, a
#define START                            BANKMASK(SSPSTAT), 3, a
#define STKFUL                           BANKMASK(STKPTR), 7, a
#define STKOVF                           BANKMASK(STKPTR), 7, a
#define STKPTR0                          BANKMASK(STKPTR), 0, a
#define STKPTR1                          BANKMASK(STKPTR), 1, a
#define STKPTR2                          BANKMASK(STKPTR), 2, a
#define STKPTR3                          BANKMASK(STKPTR), 3, a
#define STKPTR4                          BANKMASK(STKPTR), 4, a
#define STKUNF                           BANKMASK(STKPTR), 6, a
#define STOP                             BANKMASK(SSPSTAT), 4, a
#define SWDTE                            BANKMASK(WDTCON), 0, a
#define SWDTEN                           BANKMASK(WDTCON), 0, a
#define SYNC                             BANKMASK(TXSTA), 4, a
#define SYNC1                            BANKMASK(TXSTA), 4, a
#define T08BIT                           BANKMASK(T0CON), 6, a
#define T0CKI                            BANKMASK(PORTA), 4, a
#define T0CS                             BANKMASK(T0CON), 5, a
#define T0IE                             BANKMASK(INTCON), 5, a
#define T0IF                             BANKMASK(INTCON), 2, a
#define T0IP                             BANKMASK(INTCON2), 2, a
#define T0PS0                            BANKMASK(T0CON), 0, a
#define T0PS1                            BANKMASK(T0CON), 1, a
#define T0PS2                            BANKMASK(T0CON), 2, a
#define T0SE                             BANKMASK(T0CON), 4, a
#define T1CKI                            BANKMASK(PORTC), 0, a
#define T1CKPS0                          BANKMASK(T1CON), 4, a
#define T1CKPS1                          BANKMASK(T1CON), 5, a
#define T1INSYNC                         BANKMASK(T1CON), 2, a
#define T1OSCEN                          BANKMASK(T1CON), 3, a
#define T1OSI                            BANKMASK(PORTC), 1, a
#define T1OSO                            BANKMASK(PORTC), 0, a
#define T1RD16                           BANKMASK(T1CON), 7, a
#define T1SYNC                           BANKMASK(T1CON), 2, a
#define T2CKPS0                          BANKMASK(T2CON), 0, a
#define T2CKPS1                          BANKMASK(T2CON), 1, a
#define T3CCP1                           BANKMASK(T3CON), 3, a
#define T3CKPS0                          BANKMASK(T3CON), 4, a
#define T3CKPS1                          BANKMASK(T3CON), 5, a
#define T3ECCP1                          BANKMASK(T3CON), 6, a
#define T3INSYNC                         BANKMASK(T3CON), 2, a
#define T3RD16                           BANKMASK(T3CON), 7, a
#define T3SYNC                           BANKMASK(T3CON), 2, a
#define TBB1D23                          BANKMASK(TXB1D2), 3, b
#define TEC0                             BANKMASK(TXERRCNT), 0, a
#define TEC1                             BANKMASK(TXERRCNT), 1, a
#define TEC2                             BANKMASK(TXERRCNT), 2, a
#define TEC3                             BANKMASK(TXERRCNT), 3, a
#define TEC4                             BANKMASK(TXERRCNT), 4, a
#define TEC5                             BANKMASK(TXERRCNT), 5, a
#define TEC6                             BANKMASK(TXERRCNT), 6, a
#define TEC7                             BANKMASK(TXERRCNT), 7, a
#define TMR0IE                           BANKMASK(INTCON), 5, a
#define TMR0IF                           BANKMASK(INTCON), 2, a
#define TMR0IP                           BANKMASK(INTCON2), 2, a
#define TMR0ON                           BANKMASK(T0CON), 7, a
#define TMR1CS                           BANKMASK(T1CON), 1, a
#define TMR1IE                           BANKMASK(PIE1), 0, a
#define TMR1IF                           BANKMASK(PIR1), 0, a
#define TMR1IP                           BANKMASK(IPR1), 0, a
#define TMR1ON                           BANKMASK(T1CON), 0, a
#define TMR2IE                           BANKMASK(PIE1), 1, a
#define TMR2IF                           BANKMASK(PIR1), 1, a
#define TMR2IP                           BANKMASK(IPR1), 1, a
#define TMR2ON                           BANKMASK(T2CON), 2, a
#define TMR3CS                           BANKMASK(T3CON), 1, a
#define TMR3IE                           BANKMASK(PIE2), 1, a
#define TMR3IF                           BANKMASK(PIR2), 1, a
#define TMR3IP                           BANKMASK(IPR2), 1, a
#define TMR3ON                           BANKMASK(T3CON), 0, a
#define TO                               BANKMASK(RCON), 3, a
#define TOUTPS0                          BANKMASK(T2CON), 3, a
#define TOUTPS1                          BANKMASK(T2CON), 4, a
#define TOUTPS2                          BANKMASK(T2CON), 5, a
#define TOUTPS3                          BANKMASK(T2CON), 6, a
#define TRISA0                           BANKMASK(TRISA), 0, a
#define TRISA1                           BANKMASK(TRISA), 1, a
#define TRISA2                           BANKMASK(TRISA), 2, a
#define TRISA3                           BANKMASK(TRISA), 3, a
#define TRISA4                           BANKMASK(TRISA), 4, a
#define TRISA5                           BANKMASK(TRISA), 5, a
#define TRISA6                           BANKMASK(TRISA), 6, a
